# Id Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..Id Property
WallSweepInfo Class See Also
---
The id of the sweep or reveal.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int Id { get; set; }
```

Visual Basic
---
```text
Public Property Id As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Id {
	int get ();
	void set (int value);
}
```

# ### Field Value
If the wall sweep belongs to a vertically compound structure, this must be a non-negative value. If the wall sweep belongs to a sweep defined outside of compound structures by UI or API the id will typically be -1 and is not used.
# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace